
def area(a):
    '''
        Возвращает площадь квадрата с известной длинной стороны

            Параметры:
                a (float): длина стороны квадрата
        
            Возвращаемое значение:
                a * a (float): площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
        Возвращает периметр квадрата с известной длинной стороны

            Параметры:
                a (float): длина стороны квадрата
        
            Возвращаемое значение:
                4 * a (float): периметр квадрата
    '''
    return 4 * a
